Documents/ТТМ_ОтгрузкаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ТТМ_ОтгрузкаТоваров</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыТТМОтгрузка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВыпущеннаяПродукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТСД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказКлиента</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>35</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ТТМ_ОтгрузкаТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
/////////////////////////////////////////////////////////////////////////
#Область ОбработчикСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура ВыпущеннаяПродукцияПриИзменении(Элемент)
	УстановитьУсловноеОформление();		
КонецПроцедуры

#КонецОбласти


/////////////////////////////////////////////////////////////////////////
#Область УсловноеОформление

&НаСервере
Процедура УстановитьУсловноеОформление()		
		НовыйЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ОформлениеЦветТекста = НовыйЭлементУсловногоОформления.Оформление.Элементы.Найти("ЦветТекста");
		ОформлениеЦветТекста.Значение = WebЦвета.Красный;
		ОформлениеЦветТекста.Использование = Истина;
		
		НастройкаОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НастройкаОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыпущеннаяПродукция.Количество");
		НастройкаОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		НастройкаОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыпущеннаяПродукция.ТСД");
		
		ОформляемоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ВыпущеннаяПродукцияНоменклатура");
		ОформляемоеПоле.Использование = Истина;
		
		///////////////////////////////////////////////////////////////////////////////////////////////
		НовыйЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ОформлениеЦветТекста = НовыйЭлементУсловногоОформления.Оформление.Элементы.Найти("ЦветТекста");
		ОформлениеЦветТекста.Значение = WebЦвета.Зеленый;
		ОформлениеЦветТекста.Использование = Истина;
		
		НастройкаОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НастройкаОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыпущеннаяПродукция.Количество");
		НастройкаОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НастройкаОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыпущеннаяПродукция.ТСД");
		
		ОформляемоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ВыпущеннаяПродукцияНоменклатура");
		ОформляемоеПоле.Использование = Истина;
КонецПроцедуры

#КонецОбласти
